"""枚举对象 元组"""
#===============================================================================
# 枚举对象 元组 [(0, 'a'), (1, 'b'), (2, 'c'), (3, 'e'), (4, 'f'), (5, 'g')]
# 元组 所谓元则不能改变顺序
#===============================================================================
print ("===================================枚举对象====================================")
# 1. 先根据列表, 创建一个枚举对象
values = ["a", "b", "c", "e", "f", "g"]
print("枚举对象"+str(list(enumerate(values))))

# 遍历整个的枚举对象(枚举对象, 可以直接被遍历)
for tupleValue in enumerate(values, 100):
    print("元组"+str(tupleValue))  #[(0, 'a'), (1, 'b'), (2, 'c'), (3, 'e'), (4, 'f'), (5, 'g')]
    idx, val = tupleValue

"""集合 迭代collections"""
#===============================================================================
#（ ）是元组
# [   ]是数组
# {   }是集合 如set
# 集合" collections 迭代
#迭代 iter 好处是可以临时修改集合
#===============================================================================
print ("===================================集合  迭代 collections===================================")
# 1. 先根据列表, 创建一个集合
values = ["a", "b", "c", "e", "f", "g"]
import collections
#是否为集合
result = isinstance(values, collections.Iterable)
print("集合 迭代 collections = "+str(result))
# 2
for i in iter(values):
    print (i) 

